# GetClOpacity

## Description
Gets the opacity of the specified class.

```pascal
FUNCTION GetClOpacity(className : STRING) : INTEGER;
```

```python

def vs.GetClOpacity(className):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING||

## Version
Availability: from VectorWorks 2008
## Category
* Classes